[
  {
    "code": "DEWVN",
    "category": "Port city",
    "city": "Wilhelmshaven",
    "country": "Germany",
    "description": "Wilhelmshaven Port (Port Code: DEWVN) is Germany's only deep-water port, which is situated between the rivers Ems and Weser, on the western banks of the Jade delta. The port consists of two sections: the outer deep-water port with its characteristic transshipment bridges, and the inner port, independent from the tides and located behind a dual chamber sea lock. The port is equipped with modern quay facilities for the transshipment of bulk cargo, containers, refrigerated cargo, food, general cargo and project shipments.\n\nWilhelmshaven Harbor is an essential hub for crude oil, petroleum products, coal and chemical products, which makes a key contribution towards ensuring a secure energy supply in Germany.",
    "name": "Wilhelmshaven",
    "type": "Main Port",
    "longitude": 8.14015,
    "latitude": 53.5171,
    "timezone": "Europe/Berlin"
  },
  {
    "code": "DEBRV",
    "category": "Port city",
    "city": "Bremerhaven",
    "country": "Germany",
    "description": "Bremerhaven port (Port Code: DEBRV)is the fourth-largest container port in Europe and the second-largest German seaport, especially for automobile transshipment on a First-class automobile terminal，is located in the North Sea coast in Germany and 32 nautical miles from the open sea.\n\nBremen and Bremerhaven terminals can work with almost every type of cargo, including containers, cars, bulk and bulk goods, hazardous goods, or projects, with the support of 14 berths for mega-container vessels. The ports of Bremen have almost 100,000 parking spaces, half of them covered, for automobile handling. This service has established the ports of Bremen as one of the largest automobile hubs in the world.",
    "name": "Bremerhaven",
    "type": "Main Port",
    "longitude": 8.54626,
    "latitude": 53.5687,
    "timezone": "Europe/Berlin"
  },
  {
    "code": "CNTXG",
    "category": "Port",
    "city": "Tianjin",
    "country": "China",
    "description": "Tianjin Xingang Port (Port Code: CNTXG), also Know as Tianjin Port, is the largest man-made port in mainland China. The port is located on the western shore of the Bohai Bay, centered on the estuary of the Haihe River, 170 km southeast of Beijing and 60 km east of Tianjin city:. It covers 131 square kilometers, with over 32.7 km of quay shoreline and 159 berths, and it is mainly composed of six harbor districts. Tianjin port radiates Northeast, North, and Northwest China, Xinjiang, Inner Mongolia, etc. In addition, Tianjin port is also a connection between Northeast Asia,Central Asia, and West Asia.\n\nAlso, Tianjin Xingang is the largest artificial deep-water port in the world. The container throughput ranks among the top ten ports in China. Tianjin Xingang Port is equipped with a dock level of 300,000 tons, the main channel with a water depth of -22 meters, and 192 berths in various types. It maintains shipping and trade connections with over 800 ports in more than 200 countries and regions in the world.",
    "name": "Xingang",
    "type": "Main Port",
    "longitude": 117.74822,
    "latitude": 38.98241,
    "timezone": "Asia/Shanghai"
  },
  {
    "code": "CNTAO",
    "category": "Port city",
    "city": "Qingdao",
    "country": "China",
    "description": "The Port of Qingdao (port code: CNTAO) is located on the bank of Jiaozhou Bay in Shandong Peninsula, China, on the edge of the Yellow Sea, across the sea from Japan and the Korean Peninsula. It is an international trade port and maritime transportation hub on the west coast of the Pacific Rim of China. It is mainly engaged in logistics services such as loading and unloading, storage, transfer, and distribution of various types of import and export cargo such as containers, crude oil, iron ore, coal, and grain, as well as international and domestic passenger transportation services.\n\nThe port water area of Qingdao Port is 420 square kilometers. The port has five major areas: Dagang Port Area, Huangdao Oil Port Area, Qianwan Port Area, Dongjiakou Port Area, and Weihai Port Area. Qingdao Port has trade relations with over 700 ports in 180 countries and regions worldwide. The port has more than 160 container shipping routes, direct to Southeast Asia, the Middle East, the Mediterranean, Europe, the Black Sea, Russia, Africa, and Australia, with more than 500 liner ships per month.\n\nQingdao Port has the world's largest 400,000-ton ore terminal, 450,000-ton crude oil terminal, a container terminal that can dock the world's largest 24,000-ton vessel, and a dedicated terminal that can anchor the world's largest 227,000-ton cruise ship. As of May 2023, Qingdao Port has more than 200 container shipping routes. The port's cargo throughput in 2021 is 657 million tons, a year-on-year increase of 4.2%, and container throughput reaches 24.82 million TEUs, a year-on-year increase of 7.8%.",
    "name": "Qingdao",
    "type": "Main Port",
    "longitude": 120.2663,
    "latitude": 36.05302,
    "timezone": "Asia/Shanghai"
  },
  {
    "code": "CNNBO",
    "category": "Port city",
    "city": "Ningbo",
    "country": "China",
    "description": "The Port of Ningbo (port code: CNNGB) is located on the east coast of Zhejiang and includes five port areas: Beilun, Ningbo, Zhenhai, Daxie and Chuanshan. It is a comprehensive modern port integrating inland river ports, estuary ports and seaports.\n\nIn 2006, the Port of Ningbo was merged with the neighboring Port of Zhoushan to form Ningbo-Zhoushan Port. In 2012, the combined Ningbo-Zhoushan Port handled a total cargo volume of 744 million tons, making it the largest port in the world in terms of cargo tonnage, surpassing the Port of Shanghai for the first time. In 2021, Ningbo Zhoushan Port will become the third container port in the world to reach 30 million TEUs after the Port of Shanghai and the Port of Singapore.\n\nThe merged Ningbo-Zhoushan Port consists of 19 port areas, including Zhenhai, Beilun, Daxie, Chuanshan, Meishan, Jintang, Qushan, Liuheng, Cengang and Yangshan, etc. The port has more than 620 production berths, including nearly 170 berths for cargo ships above 10,000 tons and more than 100 deep-water berths for cargo ships above 50,000 tons. It is the largest ultra-large cargo ship distribution port in China.\n\nNingbo-Zhoushan Port is located in the middle of the coastline of mainland China, facing East Asia and the entire Pacific Rim. Hong Kong, Kaohsiung, Busan, Osaka, and Kobe are all within 1,000 nautical miles. Ningbo-Zhoushan Port currently has more than 300 container liner routes, with over 700 liner shifts per month, and is connected to more than 600 ports in over 100 countries and regions worldwide.\n\nIn 2023, the cargo throughput of Ningbo-Zhoushan Port reached 1.324 billion tons, a year-on-year increase of 4.94%; the container throughput reached 35.301 million TEUs, a year-on-year increase of 5.85%.",
    "name": "Ningbo",
    "type": "Main Port",
    "longitude": 121.84673,
    "latitude": 29.94439,
    "timezone": "Asia/Shanghai"
  },
  {
    "code": "CNNGB",
    "category": "Port city",
    "city": "Ningbo",
    "country": "China",
    "description": "The Port of Ningbo (port code: CNNGB) is located on the east coast of Zhejiang and includes five port areas: Beilun, Ningbo, Zhenhai, Daxie and Chuanshan. It is a comprehensive modern port integrating inland river ports, estuary ports and seaports.\n\nIn 2006, the Port of Ningbo was merged with the neighboring Port of Zhoushan to form Ningbo-Zhoushan Port. In 2012, the combined Ningbo-Zhoushan Port handled a total cargo volume of 744 million tons, making it the largest port in the world in terms of cargo tonnage, surpassing the Port of Shanghai for the first time. In 2021, Ningbo Zhoushan Port will become the third container port in the world to reach 30 million TEUs after the Port of Shanghai and the Port of Singapore.\n\nThe merged Ningbo-Zhoushan Port consists of 19 port areas, including Zhenhai, Beilun, Daxie, Chuanshan, Meishan, Jintang, Qushan, Liuheng, Cengang and Yangshan, etc. The port has more than 620 production berths, including nearly 170 berths for cargo ships above 10,000 tons and more than 100 deep-water berths for cargo ships above 50,000 tons. It is the largest ultra-large cargo ship distribution port in China.\n\nNingbo-Zhoushan Port is located in the middle of the coastline of mainland China, facing East Asia and the entire Pacific Rim. Hong Kong, Kaohsiung, Busan, Osaka, and Kobe are all within 1,000 nautical miles. Ningbo-Zhoushan Port currently has more than 300 container liner routes, with over 700 liner shifts per month, and is connected to more than 600 ports in over 100 countries and regions worldwide.\n\nIn 2023, the cargo throughput of Ningbo-Zhoushan Port reached 1.324 billion tons, a year-on-year increase of 4.94%; the container throughput reached 35.301 million TEUs, a year-on-year increase of 5.85%.",
    "name": "Ningbo",
    "type": "Main Port",
    "longitude": 121.84673,
    "latitude": 29.94439,
    "timezone": "Asia/Shanghai"
  },
  {
    "code": "CNYAN",
    "category": "Port",
    "city": "Shanghai",
    "country": "China",
    "description": "Built to allow the Port of Shanghai to grow despite shallow waters near the shore, it allows berths with depths of up to 15 metres (49 ft) to be built, and can handle today's largest container ships. In mid-2011, port officials said the port was on track to move 12.3 million Twenty-foot equivalent units (TEUs) during the year, up from 10.1 million TEUs in 2010. In 2015, the port handled 36.54 million TEUs, and by 2019, its throughput had increased to 43.35 million TEU.",
    "name": "Yangshan",
    "type": "Main Port",
    "longitude": 122.13446,
    "latitude": 30.60723,
    "timezone": "Asia/Shanghai"
  },
  {
    "code": "MAPTM",
    "category": "Port",
    "city": "Tangier",
    "country": "Morocco",
    "description": "Port Tangier Mediterranee (Port Code: MAPTM) is a port located 45 km northeast of Tanger and opposite of Tarifa, Spain (15 km north) on the Strait of Gibraltar. As the largest port in Africa, it is Moroccan gateway and transshipment hub built in 2007. It consists of an industrial platform for 1100 companies representing an annual export business volume in 2020 of 8000 million EUR, operating in various sectors such as automotive, aeronautics, food processing, logistics and textiles. It is capable of handling 9 million containers, 7 million passengers, 700,000 trucks and the export of 1 million vehicles.",
    "name": "Port Tangier Mediterranee",
    "type": "Feeder Port",
    "longitude": -5.4969,
    "latitude": 35.89479,
    "timezone": "Africa/Casablanca"
  },
  {
    "code": "DEHAM",
    "category": "Port city",
    "city": "Hamburg",
    "country": "Germany",
    "description": "Hamburg port (port code: DEHAM) is the largest and the most important port in Germany. It is situated on the River Elbe, 65 nautical miles from the open sea.\n\nThis port has over 320 berths, handling a wide variety of cargoes and especially prominent in container and petroleum movements. It provides facilities to load/discharge oversized units. There are also transshipment facilities, including the container block train system and the Elbe Lateral Canal which links Hamburg to Magdeburg, Aken, Riesa, Dresden, Decin and Prague, as well as Brunswick and Hanover.\n\nThis port handles approximately 121,200,000t of cargo, 8,000,000TEU, 112,200 passengers and 23,800 vessels regularly. The types of vessels regularly calling at this port are cargo vessels, accounting for about 52%; and tankers, taking up around 15%. The maximum length of the vessels recorded to having entered this port is 400 meters. The maximum draught is 15.1 meters. The maximum deadweight is 241,960t.",
    "name": "Hamburg",
    "type": "Main Port",
    "longitude": 9.97992,
    "latitude": 53.5349,
    "timezone": "Europe/Berlin"
  },
  {
    "code": "NLRTM",
    "category": "Port city",
    "city": "Rotterdam",
    "country": "Netherlands",
    "description": "The Port of Rotterdam (Port Code: NLRTM) is the largest seaport in Europe located in and near the city: of Rotterdam, in the province of South Holland in the Netherlands. Covering 105 square kilometres, the port of Rotterdam now stretches over a distance of 40 kilometres. It is located in the middle of the Rhine-Meuse-Scheldt delta. Rotterdam has five port concessions (ports) within its boundaries - operated by separate companies under the overall authority of Rotterdam. Rotterdam consists of five distinct port areas and three distribution parks that facilitate the needs of a hinterland with over 50,000,000 consumers throughout the continent of Europe. The largest ships in the world can enter the harbor directly from the sea - ships drawing up to 24 meters. Rotterdam is far and away the most important trading point for mineral oil in Europe. Millions of tons of oil arrive every year. About half of it is shipped on to the Rhur district and to Antwerp and the other half is processed directly at the port. Almost all oil companies have refineries at the port and large consumers like Frankfurt Airport in Germany are directly connected to Rotterdam through their own pipelines. Due to the mineral oils and chemicals handled there, strictest safety regulations are in use since 1.2 million people are living directly at the side of the port.",
    "name": "Rotterdam",
    "type": "Main Port",
    "longitude": 4.1674,
    "latitude": 51.93567,
    "timezone": "Europe/Amsterdam"
  },
  {
    "code": "EGSUZ",
    "category": "Port",
    "city": "Suez",
    "country": "Egypt",
    "description": "El Suweis port (port code: EGSUZ), also known as Suez port, is a large port in Egypt. It lies at the southern end of the Suez Canal and the head of the Gulf of Suez, approximately 170 kilometers south of Port Said.\n\nThe contains two harbors, Port Ibrahim and Port Tawfiq, and covers a large area of Egypt’s Eastern Desert. Port Ibrahim provides berths for general cargo and passenger vessels, and Port Tewfik is used to accommodate passenger vessels in transit.\n\nThe port is connected by both highway and rail networks with Cairo and Port Said, and it has pipelines that carry finished petroleum products to Cairo. Port Suez is also a resting point for Muslim pilgrims going to and from the holy city: of Mecca.\n\nThe port handles approximately 2,400,000TEU and 900 vessels annually. The types of vessels regularly calling at this port are bulk carriers, accounting for about 44%; oil/chemical tankers, taking up around 18%; and general cargo vessels, taking a proportion of 13%. The maximum length of the vessels recorded to having entered this port is 400 meters. The maximum draught is 16.6 meters. The maximum deadweight is 319,191t.",
    "name": "El Suweis",
    "type": "Feeder Port",
    "longitude": 32.38447,
    "latitude": 30.34374,
    "timezone": "Africa/Cairo"
  },
  {
    "code": "SGSIN",
    "category": "Port city",
    "city": "Singapore",
    "country": "Singapore",
    "description": "Singapore Port (Port Code: SGSIN) is a port Located on the southern end of the Malay Peninsula, 30km south-west of the Port of Johor in Malaysia. The port is the busiest container transhipment hub and the largest publicly owned port in the world, offering connectivity to more than 600 ports in 123 countries. Equipped with six terminals and eighty four berths, the port offers a range of services for break bulk and specialised cargoes. The facilities and services allow the port to handle containers and cargo including bulk, break-bulk and project cargo. It handled 37.2 million twenty-foot equivalent units (TEUs) of containers and 626.2 million tonnes of cargo in 2019. It annually attracts approximately 130,000 vessel calls a year on average.",
    "name": "Singapore",
    "type": "Main Port",
    "longitude": 103.85457,
    "latitude": 1.2576,
    "timezone": "Asia/Singapore"
  },
  {
    "code": "KRPUS",
    "category": "Port city",
    "city": "Busan",
    "country": "South Korea",
    "description": "Busan Port (port code: KRPUS), also known as Pusan Port, is the largest port in South Korea. It is located at the mouth of the Naktong River, at the southeastern tip of the Korean peninsula, a little over 110 nautical miles east-southeast of the Port of Kitakyushu in Japan.\n\nThe port is divided into five areas: North Port, South Port, Gamcheon Port, Dadaepo Port and Busan New Port. North Port, the main harbour, has a natural deep-water harbour divided by Yong Do into two areas, comprising of an inner and outer harbour. The inner harbour is due to be urbanised and its commercial shipping will be moved to other areas of the port. The outer harbour handles mainly container cargoes and large cruise ships. South Port is mainly used by coastal and fishing vessels. Gamcheon Harbour, which is being further developed, handles containers, dry and liquid bulk and ship repair/drydock facilities. Dadaepo Port is a small port for ferries and general cargo. Busan New Port (PNC), in the district of Kadeokdo area to the west of Busan, is currently under construction with the first 18 new container berths in operation.\n\nThe port handles approximately 200 million tons of cargo and 14.2 million TEUs annually. The main exports leaving this port include machinery, manufactured products and containerised cargoes. The principal imports entering this port are cement, grain, machinery, oil, timber, steel products and containerised general cargo.\n\nThe port handles approximately 200 million tons of cargo and 14.2 million TEUs annually. The main exports leaving this port include machinery, manufactured products and containerised cargoes. The principal imports entering this port are cement, grain, machinery, oil, timber, steel products and containerised general cargo.\n\nEach year about 83,547 vessels and 25,000 passengers visit this port. The types of vessels regularly calling at this port are cargo vessels, accounting for around 41%; fishing vessels, taking up about 17%; and tankers, taking a proportion of 14%. The maximum length of the vessels recorded to having entered this port is 364 meters. The maximum draught is 13.6 meters. The maximum deadweight is 131,292t.",
    "name": "Busan",
    "type": "Main Port",
    "longitude": 129.04707,
    "latitude": 35.10227,
    "timezone": "Asia/Seoul"
  },
  {
    "code": "CNYTN",
    "category": "Port",
    "city": "Shenzhen",
    "country": "China",
    "description": "Yantian Port, port code: CNYTN, located in Dapeng Bay, east of Shenzhen, Guangdong Province, China. Port of Shenzhen consists of Yantian Port, Dachang Bay Port, Shekou Port, Chiwan Port, Fuyong Port, ICD Pinghu, etc. Yantian Port is the biggest one accouting for half of the cargo volume of Shenzhen Port which ranked the world's No.4 Container Port in 2020.\n\nYantian Port is the leading gateway serving import and export container traffic, Characterized by its natural deep-water berths and unparalleled mega-vessel handling capabilities. Yantian Port is the preferred port-of-call for mega-vessels in South China and one of the busiest container terminals in the world.\n\nYantian Port is associated with 34 shipping companies, including three major global shipping alliances (2M, OCEAN Alliance, THE Alliance), with approximately one hundred shipping lines linking with the rest of the world. Besides, it enjoys an extensive network of expressways and offers feeder services to connect with most areas in China, making it convenient for customer to deliver their containers. In 2021, the throughput capacity: in Yantian Port reaches 200 million TEU. It enjoys the natural deep-water, with 20 large-scale container deep-water berths in the port area and its wharf area covering 417 hectares. Therefore, Yantian port has become the optimal option for shipping companies, especially those with super-large scale ships. It boasts cutting-edge shipping operation efficiency, ensuring nearly 20,000 container trucks in and out during peak time.",
    "name": "Yantian",
    "type": "Main Port",
    "longitude": 114.26551,
    "latitude": 22.56608,
    "timezone": "Asia/Shanghai"
  },
  {
    "code": "ITGIT",
    "category": "Port city",
    "city": "Gioia Tauro",
    "country": "Italy",
    "description": "The Port of Gioia Tauro (port code: ITGIT ) is located in the north of the city: of Reggio Calabria, between the municipalities of Gioia Tauro and San Ferdinando, Calabria, is the largest port in Italy for the container in terms of throughput.\n\nThe port district has a total area of 4,400,000 square meters (440 ha), and it has a channel configuration with an internal water surface area of 180 acres, unfolding parallel to the coast. The port has 5,125 meters of docks. The water depth reaches 18 meters. On January 30, 2015, the port of Gioia Tauro welcomed the MSC London: with its 16,650 TEUs, it is the largest container carrier to have ever berthed in Italy.",
    "name": "Gioia Tauro",
    "type": "Feeder Port",
    "longitude": 15.9006,
    "latitude": 38.4454,
    "timezone": "Europe/Rome"
  },
  {
    "code": "DKAHS",
    "category": "Port city",
    "city": "Aarhus",
    "country": "Denmark",
    "description": "Aarhus Port (port code: DKAHS / DKAAR) is the largest container port in Denmark, handling over 60% of the country's total container traffic and the harbour is open all year round. It is situated in Aarhus Bay on the east coast of Jutland.\n\nThe port has a total of 6 terminals, including container, bulk cargo, tanker, ferry and cruise terminals. The container terminal covers an area of 750,000 square meters. The bulk cargo terminal handles grain, sand and gravel. The tanker terminal handles petroleum, gasoline, chemicals, molasses and cement.\n\nThe port handles approximately 11.3 million tons of cargo and 396,000TEU annually. The principal imports entering this port are coal, grain, oil cake, fodder, copra oil, fertilisers, soya beans and timber. The main exports leaving this port are agricultural products including dairy produce, vegetable oils, canned meat, bacon and condensed milk. Refrigerating plant, furniture and machinery are also exported.\n\nEach year about 8,136 vessels and Ro-Ro ferries, including 25 major cruise vessels visit this port. The maximum length of the vessels recorded to having entered this port is 400 meters. The maximum draught is 12.6 meters. The maximum deadweight is 214,733t.",
    "name": "Aarhus",
    "type": "Feeder Port",
    "longitude": 10.23,
    "latitude": 56.1564,
    "timezone": "Europe/Copenhagen"
  },
  {
    "code": "DKAAR",
    "category": "Port city",
    "city": "Aarhus",
    "country": "Denmark",
    "description": "Aarhus Port (port code: DKAHS / DKAAR) is the largest container port in Denmark, handling over 60% of the country's total container traffic and the harbour is open all year round. It is situated in Aarhus Bay on the east coast of Jutland.\n\nThe port has a total of 6 terminals, including container, bulk cargo, tanker, ferry and cruise terminals. The container terminal covers an area of 750,000 square meters. The bulk cargo terminal handles grain, sand and gravel. The tanker terminal handles petroleum, gasoline, chemicals, molasses and cement.\n\nThe port handles approximately 11.3 million tons of cargo and 396,000TEU annually. The principal imports entering this port are coal, grain, oil cake, fodder, copra oil, fertilisers, soya beans and timber. The main exports leaving this port are agricultural products including dairy produce, vegetable oils, canned meat, bacon and condensed milk. Refrigerating plant, furniture and machinery are also exported.\n\nEach year about 8,136 vessels and Ro-Ro ferries, including 25 major cruise vessels visit this port. The maximum length of the vessels recorded to having entered this port is 400 meters. The maximum draught is 12.6 meters. The maximum deadweight is 214,733t.",
    "name": "Aarhus",
    "type": "Feeder Port",
    "longitude": 10.23,
    "latitude": 56.1564,
    "timezone": "Europe/Copenhagen"
  },
  {
    "code": "MYTPP",
    "category": "Port city",
    "city": "Tanjung Pelepas",
    "country": "Malaysia",
    "description": "The Port of Tanjung Pelepas (Port Code: MYTPP) is a container port located in Iskandar Puteri, Johor Bahru District, Johor, Malaysia. Strategically located at the confluence of the main east-west shipping lanes, it has 14 linear berths totalling 5.04km. The terminal is equipped with 66 Super Post Panamax cranes, 24 of which have a 24-box outreach catering for the next generation of Triple E size vessels. The port is situated on the eastern mouth of the Pulai River in south-western Johor, Malaysia, in close proximity to the Straits of Johor, which separates the countries of Malaysia and Singapore and the Strait of Malacca. Transshipment accounts for over 90 percent of the port's traffic and was constructed in an attempt to compete with Singaporean ports. With an annual capacity: of 12,500,000 TEU, it is Malaysia’s most advanced container terminal.",
    "name": "Tanjung Pelepas",
    "type": "Main Port",
    "longitude": 103.54383,
    "latitude": 1.34848,
    "timezone": "Asia/Kuala_Lumpur"
  },
  {
    "code": "SEGOT",
    "category": "Port city",
    "city": "Goteborg",
    "country": "Sweden",
    "description": "Port of Gothenburg (Göteborg) (port code: SEGOT) is the largest port in the Nordic countries and the central Nordic port for liner shipping with about 30% of its general cargo imports and exports being transit cargo to or from other Nordic countries. It is situated on the west coast of Sweden.\n\nThe port has a complex of a unit load centre of 2,000,000 square meters with 2,500 meters of quay length and 11 container cranes including 2 post Panamax and 3 super post Panamax with a lifting capacity: of 103t each. In addition, the port also has cruise liner facilities with berths dedicated to cruise vessels.\n\nThe port handles approximately 41,300,000t of cargo including 887,000TEU and 1,700,000 passengers annually. The types of vessels regularly calling at this port are tankers, accounting for about 31%; and cargo vessels, taking up around 29%. The maximum length of the vessels recorded to having entered this port is 400 meters. The maximum draught is 15 meters. The maximum deadweight is 318,227t.",
    "name": "Goteborg",
    "type": "Feeder Port",
    "longitude": 11.9634,
    "latitude": 57.7121,
    "timezone": "Europe/Stockholm"
  },
  {
    "code": "CNNBO",
    "category": "Port city",
    "city": "Goteborg",
    "country": "Sweden",
    "description": "Port of Gothenburg (Göteborg) (port code: SEGOT) is the largest port in the Nordic countries and the central Nordic port for liner shipping with about 30% of its general cargo imports and exports being transit cargo to or from other Nordic countries. It is situated on the west coast of Sweden.\n\nThe port has a complex of a unit load centre of 2,000,000 square meters with 2,500 meters of quay length and 11 container cranes including 2 post Panamax and 3 super post Panamax with a lifting capacity: of 103t each. In addition, the port also has cruise liner facilities with berths dedicated to cruise vessels.\n\nThe port handles approximately 41,300,000t of cargo including 887,000TEU and 1,700,000 passengers annually. The types of vessels regularly calling at this port are tankers, accounting for about 31%; and cargo vessels, taking up around 29%. The maximum length of the vessels recorded to having entered this port is 400 meters. The maximum draught is 15 meters. The maximum deadweight is 318,227t.",
    "name": "Goteborg",
    "type": "Feeder Port",
    "longitude": 11.9634,
    "latitude": 57.7121,
    "timezone": "Europe/Stockholm"
  }
]
